base/Catalogs/бит_СчетаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СчетаБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Comment>Счет</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображать</Name>
					<Comment>Не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_СчетаБюджета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	// Изменение кода. Начало. 14.04.2014{{
	УстановитьПараметрыВыбораДляСчетов();
	// Изменение кода. Конец. 14.04.2014}}
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	СформироватьНаименованиеПолноеАвтоматически();

КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)

	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();

КонецПроцедуры // НаименованиеПолноеПриИзменении()

&НаКлиенте
Процедура НаименованиеПолноеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
	
		Объект.НаименованиеПолное = ВыбранноеЗначение;
		АвтоНаименованиеПолное = Истина;
	
	КонецЕсли;
	
КонецПроцедуры // НаименованиеПолноеОбработкаВыбора()

&НаКлиенте
Процедура НаименованиеПолноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	Элемент.СписокВыбора.Добавить(Объект.Наименование);
	
КонецПроцедуры // НаименованиеПолноеАвтоПодбор()

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Счет) Тогда		
		ДанныеЭлемента = ДанныеДляЗаполнения(Объект.Счет, Объект.Коэффициент);
		Объект.Наименование 	  = ДанныеЭлемента.Наименование;
		Объект.НаименованиеПолное = ДанныеЭлемента.НаименованиеПолное;
		Объект.Кодификатор 	   	  = ДанныеЭлемента.Код;
		Объект.Коэффициент 	   	  = ДанныеЭлемента.Коэффициент;				
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеЭлемента = ОбработкаВыбораСчета(ВыбранноеЗначение, Объект.Счет, Объект.Владелец, Объект.Коэффициент);
	Если ДанныеЭлемента <> Неопределено Тогда
		Объект.Счет = ВыбранноеЗначение;
		Объект.Наименование 	  = ДанныеЭлемента.Наименование;
		Объект.НаименованиеПолное = ДанныеЭлемента.НаименованиеПолное;
		Объект.Кодификатор 	   	  = ДанныеЭлемента.Код;
		Объект.Коэффициент 	   	  = ДанныеЭлемента.Коэффициент;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДанныеДляЗаполнения(Знач Счет, Знач Коэффициент)

	ДанныеЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Счет, "Наименование, НаименованиеПолное, Код");
		
	Если Коэффициент = 0 Тогда
		Коэффициент = 1;		
	КонецЕсли;
	
	ДанныеЭлемента.Вставить("Коэффициент", Коэффициент);
	
	Возврат ДанныеЭлемента;
     
КонецФункции

&НаСерверебезКонтекста
Функция ОбработкаВыбораСчета(Знач ВыбранноеЗначение, Знач Счет, Знач Бюджет, Знач Коэффициент)

	НайденныйСчет = Справочники.бит_СчетаБюджета.НайтиПоРеквизиту("Счет", ВыбранноеЗначение,, Бюджет);	
	ДанныеЭлемента = Неопределено;
    
	Если ЗначениеЗаполнено(НайденныйСчет) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Счет %1 уже подобран в бюджет ""%2"".';
									    |en='Account %1 has already been picked up by the Budget ""%2"".'"), 
								   ВыбранноеЗначение, Бюджет);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
	Иначе
		ДанныеЭлемента = ДанныеДляЗаполнения(ВыбранноеЗначение, Коэффициент);
	КонецЕсли; 
	
	Возврат ДанныеЭлемента;
	
КонецФункции

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  МассивЭлементов - Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.Счет);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

// Процедура проверяет, совпадало ли ранее полное наименование с наименованием,
// и присваивает соответствующее значение переменной мФормироватьНаименованиеПолноеАвтоматически.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

	Если ПустаяСтрока(Объект.НаименованиеПолное) 
	 ИЛИ Объект.НаименованиеПолное = Объект.Наименование Тогда
		АвтоНаименованиеПолное = Истина;
	Иначе
		АвтоНаименованиеПолное = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

// Процедура проверяет, необходимо ли формировать полное наименование автоматически или нет,
// и, если необходимо, формирует его.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура СформироватьНаименованиеПолноеАвтоматически()

	Если АвтоНаименованиеПолное Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры // СформироватьНаименованиеПолноеАвтоматически()

#КонецОбласти
